/*
 * switcher.c
 *
 *  Created on: 2016年10月19日
 *      Author: LanHua
 */

#include "switcher.h"

//=================接口函数声明=======================================
//=========================================================================
//函数名称：switcher_init
//函数参数：port_pin：(端口号)|(引脚号)（如：(PTB_NUM)|(9) 表示为B口9号脚）
//pullselect:默认开关是开启还是关闭
//函数返回：无
//功能概要：开关初始化。
//======================================================================
void switcher_init(uint_16 port_pin,uint_8 pullselect){
	gpio_init(port_pin, GPIO_IN,0);
	gpio_pull(port_pin,pullselect);
}

//=================接口函数声明=======================================
//=========================================================================
//函数名称：switcher_state
//函数参数：无
//函数返回：uint_8:1开，0闭s
//功能概要：获取当前开关状态。
//======================================================================
uint_8 switcher_state(uint_16 port_pin){
    return gpio_get(port_pin);
}




